const charDataList ={
//			  Default	Cx		  Cy		Xl		  Xc		Y		  S			  Roboto   Cx		 Cy		   Xl		 Xc		   Y		 S,  		 Military	Cx		  Cy		Xl		  Xc		Y		  S		   14-Segment Cx		Cy		  Xl		Xc		  Y			S			Stencil	  Cx		Cy		  Xl		Xc		  Y			S
	"-":	{"default":[ 0.00000, -0.00155,  0.16554,  0.00000,  0.26352,  0.06750], "roboto":[-0.00115,  0.00220,  0.13715, -0.00075,  0.30207,  0.26230], "military":[ 0.00044, -0.00065,  0.15870, -0.03660,  0.30517,  0.04400], "14seg":[-0.00156,  0.00000,  0.40740, -0.00065,  0.50000,  0.09883], "stencil":[ 0.00235, -0.00070,  0.24220,  0.00000,  0.25590,  0.15090]},
	"|":	{"default":[ 0.00287,  0.00000,  0.13177,  0.00338,  0.25676,  0.19230], "roboto":[-0.00185,  0.00483,  0.12185,  0.00000,  0.28950,  0.85970], "military":[ 0.00147, -0.00065,  0.04884, -0.03662,  0.30520,  0.14299], "14seg":[-0.00169,  0.00000,  0.40804,  0.00000,  0.50000,  0.56537], "stencil":[ 0.00005,  0.00614,  0.09138,  0.00000,  0.31012,  0.70130]},
	"+":	{"default":[ 0.00006, -0.00156,  0.29053,  0.00000,  0.32770,  0.03470], "roboto":[-0.00055, -0.00685,  0.28180, -0.00160,  0.33019,  0.12829], "military":[ 0.00043,  0.00205,  0.15870, -0.03660,  0.30517,  0.04400], "14seg":[-0.00173,  0.00000,  0.40739, -0.00065,  0.50000,  0.09883], "stencil":[ 0.00450,  0.00902,  0.24026,  0.00000,  0.25542,  0.15090]},
	".":	{"default":[ 0.00000,  0.00000,  0.13852,  0.00000,  0.05405,  0.16670], "roboto":[-0.00050,  0.00540,  0.12650, -0.00510,  0.04830,  0.55600], "military":[ 0.00147,  0.00146,  0.04884, -0.03661,  0.04883,  0.14298], "14seg":[ 0.00000,  0.00081,  0.00000,  0.00000,  0.06200,  0.42105], "stencil":[-0.00090,  0.00000,  0.14400,  0.00570,  0.09230,  0.30355]},
	"□":	{"default":[ 0.00000,  0.00000,  0.30068,  0.00000,  0.30068,  0.02809], "roboto":[ 0.00000,  0.00000,  0.30235,  0.00000,  0.29650,  0.11730], "military":[ 0.00000,  0.00000,  0.30068,  0.00000,  0.30068,  0.02809], "14seg":[ 0.00000,  0.00000,  0.30068,  0.00000,  0.30068,  0.02809], "stencil":[ 0.00000,  0.00000,  0.30068,  0.00000,  0.30068,  0.03213]},
	"■":	{"default":[ 0.00000,  0.00000,  0.30000,  0.00000,  0.30000,  0.05682], "roboto":[ 0.00000,  0.00000,  0.30233,  0.00000,  0.30233,  0.14524], "military":[ 0.00000,  0.00000,  0.30000,  0.00000,  0.30000,  0.05682], "14seg":[ 0.00000,  0.00000,  0.30000,  0.00000,  0.30000,  0.05682], "stencil":[ 0.00000,  0.00000,  0.30000,  0.00000,  0.30000,  0.06500]},
	"○":	{"default":[ 0.00000,  0.00000,  0.30000,  0.00000,  0.30000,  0.06250], "roboto":[ 0.00045,  0.00000,  0.30230,  0.00000,  0.30233,  0.16053], "military":[ 0.00000,  0.00000,  0.30000,  0.00000,  0.30000,  0.06250], "14seg":[ 0.00000,  0.00000,  0.30000,  0.00000,  0.30000,  0.06250], "stencil":[ 0.00000,  0.00000,  0.30000,  0.00000,  0.30000,  0.07150]},
	"●":	{"default":[ 0.00000,  0.00000,  0.30000,  0.00000,  0.28333,  0.06250], "roboto":[ 0.00050,  0.00020,  0.30230,  0.00000,  0.28490,  0.16053], "military":[ 0.00000,  0.00000,  0.30000,  0.00000,  0.28333,  0.06250], "14seg":[ 0.00000,  0.00000,  0.30000,  0.00000,  0.28333,  0.06250], "stencil":[ 0.00000,  0.00000,  0.30000,  0.00000,  0.28333,  0.07150]}
};

const fontDefaultList = {
//				Cx		  Cy		Xl		  Xc		Y		  S
	"default": [ 0.00000,  0.00000,  0.00000,  0.00000,  0.34670,  0.00000],
	"roboto" : [ 0.00000,  0.00000,  0.00000,  0.00000,  0.34180,  0.00000],
	"military":[ 0.00000,  0.00000,  0.00000,  0.00000,  0.34790,  0.00000],
	"14seg"  : [ 0.00000,  0.00000,  0.00000,  0.00000,  0.50000,  0.00000],
	"stencil": [ 0.00000,  0.00000,  0.00000,  0.00000,  0.32568,  0.00000]
};

const charSizeList = {//x	  y
	"|":{"default":[ 0.08130,  0.92550], "roboto":[ 0.10320,  0.87000], "military":[ 0.09530,  0.70300], "14seg":[ 0.08500,  0.75000], "stencil":[ 0.07350,  0.91000]},
	"-":{"default":[ 0.24000,  0.07820], "roboto":[ 0.26000,  0.10480], "military":[ 0.31000,  0.09100], "14seg":[ 0.42000,  0.09760], "stencil":[ 0.36000,  0.04620]},
	".":{"default":[ 0.09500,  0.10800], "roboto":[ 0.14000,  0.14300], "military":[ 0.09520,  0.09520], "14seg":[ 0.11840,  0.11980], "stencil":[ 0.18100,  0.16800]}
}


const messageList = {
	"font":"使用するフォント\n(ラベル設定のFont)",
	"align":"水平方向の座標の基準点を指定\n(ラベル設定のHorizonral Anchorと同等)",
	"valign":"ラベル設定のVertical Anchor",
	"drawType":"表示するものの種別\n・文字/文字列：指定した文字または文字列を表示\n・ライン描画：指定した太さの線を表示(|を使用)、配置タイプ:単体の場合は.を表示\n・コメント挿入：メモ欄に入力した文章をラベルのコード内にコメントとして埋め込む",
	"layoutType":"文字の配置の仕方\n・単体：文字または文字列を単体で表示\n・円　：円形に並べて配置\n・円弧：円弧上に配置\n・直線：直線状に配置",
	"memo":"自由記入欄\n本エディタの一覧上で要素を見分けやすくするために使う",

	"char":"表示する文字または文字列",
	"color":"表示色を指定\n(空欄の場合はラベルの色を使用)",
	"size":"文字の表示サイズ\n(<size>タグを使用)",
	"widthC":"文字の横幅の倍率\n(<scale>タグを使用、空欄の場合は1(等倍)とする)",
	"widthL":"線の太さ",
	"rotate":"文字の向きを指定\n(空欄の場合は0度とする)\n(配置に沿って回転 にチェックが入っている場合はその回転に加算)",
	"rotateL":"チェックを入れた場合、配置に応じて自動で文字の角度を調整\n(配置タイプ：単体の場合は0度固定)",
	
	"division":"分割数(FT使用不可)",
	"r":"円の半径",
	"angle":"最初に表示する文字の向き\n(3時方向を基点に反時計回りに+)",
	"angle2":"最初に表示する文字の向き～最後に表示する文字の向き\n(3時方向を基点に反時計回りに+)",
	"pos":"文字の座標",
	"posC":"円の中心座標",
	"posL":"線の始点座標~終点座標",

	"addUnit":"要素を追加",
	"deleteUnit":"要素を削除",
	"loadNew":"現在の編集内容を破棄してjsonを読込",
	"loadAdd":"現在の編集内容の末尾に付け加える形でjsonを読込",
	"save":"現在の編集内容をjson形式で保存"
}
/*
以下、メモ書き的な物
名前				値				メモ
Cx,y				数値			文字の回転中心と表示中心のズレ
Xl,c				数値			alignがleft,centerの時の文字の左端から回転中心までのズレ
Y					数値			文字の下端から回転中心までのズレ
S					数値			文字を完全に潰した時の<scale>の値*-1
posX,Y				数値			文字の位置
rotate				数値			文字の<rotate>(回転)
scale				数値			文字の<scale>(文字の横幅)
trueScales			scale*(1+S)-S	<scale>の値を補正した物
X (align=left)		 posX+(-Xl*trueScale+(cos(rotate)*Cx          -sin(rotate)*Cy)*scale)*size
X (align=center)	(posX+(-Xc          + cos(rotate)*Cx          -sin(rotate)*Cy       )*size*scale-0.0005)*2
Y					 posY+(-Y           + sin(rotate)*Cx*trueScale+cos(rotate)*Cy       )*size
*/

